CREATE TABLE Предметы
(код_предмета INT IDENTITY(1, 1) PRIMARY KEY NOT NULL,
название NVARCHAR(50) NOT NULL,
характеристика NVARCHAR(255) NOT NULL,
вид_предмета INT NOT NULL,
редкость_предмета INT NOT NULL,
стоимость_предмета DECIMAL NULL,
возможность_обмена BIT NOT NULL,
возможность_продажи BIT NOT NULL)

CREATE TABLE Инвентарь
(код_персонажа INT NOT NULL,
код_пользователя INT NOT NULL,
код_предмета INT NOT NULL,
дата_и_время_приобретения datetime NULL,
активный_предмет BIT NOT NULL,
плюс_к_силе DECIMAL NULL,
плюс_к_броне DECIMAL NULL, 
плюс_к_здоровью DECIMAL NULL

FOREIGN KEY (код_предмета) REFERENCES Предметы(код_предмета)
ON DELETE CASCADE ON UPDATE CASCADE

CONSTRAINT [inventory_PK] PRIMARY KEY CLUSTERED (код_персонажа, код_предмета))

INSERT INTO предметы
VALUES
('керамбит', 'градиент', 1, 4, 18000.0, 1, 1),
('клеймор', 'Золотой', 1, 5, 15000.0, 1, 1),
('бастард', 'Блеск', 2, 4, 19000.0, 1, 1),
('Т-34', 'пушка', 8, 2, 8000.0, 1, 1),
('катана', 'острый', 10, 5, 40000.0, 1, 1),
('татии', 'еще острее', 10, 5, 90000.0, 1, 1),
('Вакиидзаси', 'короткий', 10, 4, 50000.0, 0, 0),
('Древние', 'старый', 6, 3, 8000.0, 1, 1),
('Большие', 'все закрывает и сохраняет нас', 6, 1, 6000.0, 0, 0),
('Абордажный', 'красивый', 3, 5, 30000.0, 1, 1);

INSERT INTO Инвентарь
VALUES
(1, 1, 1, '2004-05-13T14:25:00', 1, 1.5, 3.0, 2.0),
(2, 2, 2, '2000-06-24T17:30:00', 1, 1.7, 1.0, 4.0),
(3, 3, 3, '2014-07-12T13:30:00', 0, 1.8, 3.0, 2.0),
(4, 4, 4, '2024-09-23T14:00:00', 1, 1.2, 3.0, 4.0),
(5, 5, 5, '2022-03-16T11:00:00', 1, 0.5, 3.0, 2.0),
(6, 6, 6, '2021-06-23T12:00:00', 0, 0.9, 3.0, 4.0),
(7, 7, 7, '2020-05-17T04:00:00', 1, 0.7, 1.0, 2.0),
(8, 8, 8, '2016-02-23T00:00:00', 0, 2.5, 3.0, 4.0),
(9, 9, 9, '2013-04-18T01:45:00', 0, 3.5, 3.0, 2.0),
(10, 10, 10, '2000-10-23T23:14:00', 0, 4.5, 3.0, 7.0);