Create table Депо

(Номер_депо int PRIMARY KEY IDENTITY (1,1),
Название nvarchar(30) not null,
Количество_парковочных_мест bigint null,
Количество_ремонтных_мест int null,
Адрес nvarchar(30) not null,
Контактный_телефон nvarchar(30) not null)

Create table Пути

(Номер_депо int not null,
Номер_пути int not null,
Название nvarchar(30) not null,
Длина_пути_км bigint not null,
Путь_свободен bit not null,
Путь_электрифицирован bit not null

FOREIGN KEY (Номер_депо) REFERENCES Депо (Номер_депо)
ON DELETE CASCADE
ON UPDATE CASCADE

CONSTRAINT [Пути_PK] PRIMARY KEY CLUSTERED (Номер_пути, Номер_депо))

insert into Депо
(Название,
Количество_парковочных_мест,
Количество_ремонтных_мест,
Адрес,
Контактный_телефон)
Values
('Перерва', 50, 3, 'Москва', '89771182290'),
('Железнодорожная', 45, 2, 'Железнодорожный', '89772438943'),
('Москва-2 Ярославская', 30, 2, 'Москва', '89771234432'),
('Александров', 40, 1, 'Александров', '89165561782'),
('Лобня', 30, 4, 'Лобня', '89771182290'),
('Нахабино', 50, 5, 'Нахабино ', '89061290385'),
('Апрелевка', 45, 4, 'Апрелевка', '89771182290'),
('Краснопресненский', 35, 3, 'Красная Пресня', '89165561782'),
('Новомосковск-1', 40, 2, 'Новомосковск', '89771182290'),
('Домодедово',55, 3, 'Домодедово','89165561782');

insert into Пути
(Номер_депо,
Номер_пути,
Название,
Длина_пути_км,
Путь_свободен,
Путь_электрифицирован)

Values
(1, 1, 'Москва', 514, 1, 1),
(2, 2, 'Санкт-Петербург', 1328, 1, 1),
(3, 3, 'Симферополь', 835, 1, 1),
(4, 4, 'Адлер', 1132, 1, 1),
(5, 5, 'Сочи', 1106, 0, 0),
(6, 6, 'Анапа', 1007, 1, 1),
(7, 7, 'Рязань', 332, 1, 1),
(8, 8, 'Новороссийск', 986, 1, 1),
(9, 9, 'Лиски', 79, 1, 1),
(10, 10, 'Ростов-на-Дону',495, 1, 1);