Create table Товар (Код_товара int Primary key,
Название nvarchar(25) not null,
Число_штук_в_упаковке int not null,
Цвет nvarchar(35) not null,
Характеристики nvarchar(MAX) not null,
Страна_производства nvarchar(35) not null,
Производитель nvarchar(35) not null,
Срок_годности date not null,
);
drop table if exists Содержимое_заказов
Create table Содержимое_заказов (Номер_заказа int not null,
Код_товара int not null,
Количество int not null,
Упаковка bit not null,

Foreign key (Код_товара) references Товар (Код_товара)
On Delete cascade
On Update cascade
)

INSERT INTO Товар (
Код_товара,
Название,
Число_штук_в_упаковке,
Цвет,
Характеристики,
Страна_производства,
Производитель,
Срок_годности
)
VALUES
(123, 'Товар', 1, 'Белый', 'Характеристики', 'Китай', 'hedonist', '2021-08-06'),
(50, 'Товар', 1, 'Чёрный', 'Характеристики', 'Греция', 'hedonist', '2021-08-06'),
(36, 'Товар', 1, 'Серый', 'Характеристики', 'Корея', 'hedonist', '2021-08-06'),
(78, 'Товар', 1, 'Синий', 'Характеристики', 'Россия', 'hedonist', '2021-08-06'),
(98, 'Товар', 1, 'Жёлтый', 'Характеристики', 'Германия', 'hedonist', '2021-08-06'),
(21, 'Товар', 1, 'Оранжевый', 'Характеристики', 'Австрия', 'hedonist', '2021-08-06'),
(59, 'Товар', 1, 'Серебристый', 'Характеристики', 'Польша', 'hedonist', '2021-08-06'),
(54, 'Товар', 1, 'Красный', 'Характеристики', 'Украина', 'hedonist', '2021-08-06'),
(67, 'Товар', 1, 'Зелёный', 'Характеристики', 'Чехия', 'hedonist', '2021-08-06'),
(237, 'Товар', 1, 'Фиолетовый', 'Характеристики', 'Эстония', 'hedonist', '2021-08-06')

INSERT INTO Содержимое_заказов (
Номер_заказа,
Код_товара,
Количество,
Упаковка
)
VALUES
(1, 123, 5, 'TRUE'),
(2, 50, 3, 'TRUE'),
(3, 36, 43, 'TRUE'),
(4, 78, 12, 'TRUE'),
(5, 98, 77, 'TRUE'),
(6, 21, 2, 'TRUE'),
(7, 59, 89, 'TRUE'),
(8, 54, 34, 'TRUE'),
(9, 67, 22, 'TRUE'),
(10, 237, 65, 'TRUE');