USE [33]
GO

CREATE TABLE Трамваи
(Номер_трамвая Int PRIMARY KEY IDENTITY(1,1), 
номер_депо int not null, 
модель nvarchar(50), 
год_постройки int null, 
дата_капитального_ремонта date null,
количество_мест int null, 
количество_сидячих_мест int null, 
длина_трамвая float null, 
количество_тележек int null, 
количество_секций int null)

INSERT Трамваи
(номер_депо, модель, год_постройки, дата_капитального_ремонта,
количество_мест, количество_сидячих_мест, длина_трамвая, количество_тележек, количество_секций)

VALUES
(1, 'D8', 2020, '01-01-2022', 245, 144, 125, 49, 1),
(2, 'К9', 2007, '18-02-2008', 151, 115, 400, 37, 4),
(3, 'DW09', 2017, '13-11-2018', 245, 156, 499, 14, 1),
(4, 'К1391', 1993, '02-09-1995', 152, 115, 100, 41, 7),
(5, 'ДДп314', 1995, '01-01-1999', 245, 100, 300, 161, 42),
(6, 'ПИК9', 1990, '25-12-1999', 124, 125, 500, 41, 11),
(7, 'С314', 2014, '11-10-2004', 299, 100, 800, 49, 8),
(8, 'V159534', 2017, '14-06-2018', 200, 145, 600, 49, 9),
(9, 'Модель1', 2005, '21-05-2008', 99, 69, 700, 14, 14),
(10, 'ЦК914', 2007, '19-05-2008', 245, 115, 1500, 49, 7);

CREATE TABLE Составы_сцепок
(номер_сцепки int not null, Номер_трамвая int not null, ведущий_трамвай bit null, номер_вагона_в_сцепке int not null,

FOREIGN KEY (Номер_трамвая) REFERENCES Трамваи (Номер_трамвая)
ON DELETE CASCADE
ON UPDATE CASCADE,

CONSTRAINT [Составы_сцепок_PK] PRIMARY KEY CLUSTERED (номер_сцепки, номер_трамвая, номер_вагона_в_сцепке))

Insert into Составы_сцепок
(номер_сцепки, номер_трамвая, ведущий_трамвай, номер_вагона_в_сцепке)
VALUES
(1, 1, 1, 3),
(2, 2, 0, 35),
(3, 3, 0, 15),
(4, 4, 1, 15),
(5, 5, 0, 12),
(6, 6, 0, 14),
(7, 7, 1, 13),
(8, 8, 1, 25),
(9, 9, 0, 26),
(10, 10, 1, 35);