CREATE TABLE Предметы
(
код_предмета INT IDENTITY(1, 1) PRIMARY KEY NOT NULL,
название NVARCHAR(50) NOT NULL,
характеристика NVARCHAR(255) NOT NULL,
вид_предмета INT NOT NULL,
редкость_предмета INT NOT NULL,
стоимость_предмета DECIMAL(18,2) NULL,
возможность_обмена BIT NOT NULL,
возможность_продажи BIT NOT NULL
)
CREATE TABLE Инвентарь
(
код_персонажа INT NOT NULL,
код_пользователя INT NOT NULL,
код_предмета INT NOT NULL,
дата_и_время_приобретения datetime NOT NULL,
активный_предмет BIT NOT NULL,
плюс_к_силе INT NULL,плюс_к_броне INT NULL, 
плюс_к_здоровью INT NULL

FOREIGN KEY (код_предмета) REFERENCES Предметы(код_предмета)
ON DELETE CASCADE ON UPDATE CASCADE

PRIMARY KEY  (код_предмета, дата_и_время_приобретения, код_персонажа ))

INSERT INTO предметы
VALUES
(' тик так', 'мега Легендарный', 5, 5,4230 , 1, 1),
('Фальшион', 'Изумруд', 2, 4, 154000.53, 1, 1),
('Меч','очень крутой легендарный', 5, 5, 500, 1,1),
('Дигл', 'Пламя', 6, 3, 24000.14, 1, 1),
('Револьвер', 'Синий Легендарный', 3, 1, 80.67, 1, 1),
('АК-47', 'Поверхностная закалка', 11, 4, 4000000.25, 1, 1),
('М4А4', 'Вой', 15, 5, NULL, 0, 0),
('М4А1-С', 'Зов Джунглей', 18, 3, 800.73, 1, 1),
('бум бум', 'Белый', 8, 1, 100.00, 1, 1),
('ССГ-08', 'Паралакс', 1, 4, 600.45, 1, 1),
('Перчатки', 'Порок', 20, 5, 45550, 1, 1),
('бах-бах-бах-бах', '', 1, 5, 600.45, 1, 1),
('проверка', 'Военный', 5, 5,500 , 1, 1);
INSERT INTO Инвентарь
VALUES
(1, 1, 1, '2008-06-11T13:25:00', 1, 1, 3, 2),
(2, 2, 2, '2001-07-23T19:30:00', 1, 1, 1, 4),
(3, 3, 3, '2018-06-17T12:30:00', 0, 1, 3, 2),
(4, 4, 4, '2022-07-21T16:00:00', 1, 1, 3, 4),
(5, 5, 5, '2016-03-12T13:00:00', 1, 0, 3, 2),
(6, 6, 6, '2011-07-21T12:00:00', 0, 0, 3, 4),
(7, 7, 7, '2022-02-11T07:00:00', 1, 0, 1, 2),
(8, 8, 8, '2017-02-23T04:00:00', 0, 2, 3, 4),
(9, 9, 9, '2014-03-20T06:45:00', 0, 3, 3, 2),
(10, 10, 10, '2024-08-17T21:14:00', 0, 4, 3, 7);