Create table Преподаватели
(
Код_преподавателя int primary key identity (1,1),
Фамилия nvarchar(30) not null,
Имя nvarchar(15) not null,
Отчество nvarchar(30) null,
Образование nvarchar(50) null,
Стаж int null,
Номер_кафедры int null,
Контактный_телефон nvarchar(15) null,
)

Create table Нагрузка
(
Код_преподавателя int not null,
Код_дисциплины int not null,
Стоимость_часа decimal(7,2) null,
Почасовая_оплата bit not null,

Constraint [Нагрузка_PK] Primary key clustered (Код_преподавателя, Код_дисциплины),

Foreign key (Код_преподавателя) references Преподаватели (Код_преподавателя) 
on delete cascade 
on update cascade
)

Insert into Преподаватели

Values 
('Куплинов', 'Дмитрий', 'Алексеевич', 'Профессианальное', 1, 103, NULL),
('Меддисон', 'Егор', 'Валерьевич', 'Высшее', 5, 109, '+79875858903'),
('Горшенев', 'Михаил', 'Юрьевич', 'Послевузовское', 40, 115, NULL),
('Летов', 'Егор', 'Федотович', 'Среднее', 5, 213, '+79688898503'),
('Горбачев', 'Михаил', 'Русланович', 'Начальное', 2, 211, '+74999838903'),
('Путин', 'Владимир', 'Владимирович', 'Высшее', 15, 201, '+79809877093'),
('Булгаков', 'Дмитрий', 'Алексеевич', 'Начальное', 3, 310, '+79688876543'),
('Прохоров', 'Андрей', 'Глебович', 'Общее', 2, 312, '+79688887654'),
('Череповцев', 'Никита', 'Максимович', 'Профессианальное', 30, 301, '+79999958903'),
('Козеев', 'Авдотий', 'Денисович', 'Основное общее', 2, 401,'+79999958903');

Insert into Нагрузка

Values
(1, 30912, 150, 1),
(2, 48974, 110, 0),
(2, 12313, 110, 0),
(3, 48974, 300, 1),
(4, 92087, 100, 0),
(5, 98724, 190, 1),
(6, 92782, 110, 1),
(6, 92087, 110, 1),
(7, 24897, 90, 1),
(8, 82947, 950, 0),
(9, 92349, 180, 1),
(9, 92087, 180, 1),
(9, 95549, 180, 1),
(10, 95549, 225, 0);
