Create table Книги
(Код_книги int Primary key identity(1,1),
Код_автора int not null,
Название nvarchar(50) not null,
Год_издания int null,
Количество_страниц int not null,
Издательство nvarchar(50) not null)

Create table Абонемент
(Код_читателя int not null,
Код_книги int not null,
Дата_выдачи date not null,
Срок date not null,
Отметка_о_возврате bit not null

Constraint [Абонемент_PK] Primary key clustered (Код_читателя, Код_книги, Дата_выдачи)
Foreign key (Код_книги) references Книги (Код_книги)
ON DELETE CASCADE
ON UPDATE CASCADE
)

INSERT INTO Книги
(
Код_автора,
Название,
Год_издания,
Количество_страниц,
Издательство)
VALUES
(1,'Синтаксис',2015,150,'Москва'),
(2,'Математика',2014,250,'Дрофа'),
(3,'Букварь',2021,96,'Эксмодетство'),
(4,'Атлас',2011,224,'Просвещение'),
(5,'История',1989,320,'Клевер'),
(6,'Химия',1990,320,'Вечерняя Москва'),
(7,'Информатика',1970,210,'Бином'),
(2,'Математика',1965,250,'Дрофа'),
(3,'Аляска',2021,96,'Эксмодетство'),
(4,'Авеста',2011,224,'Москва-2');

INSERT INTO Абонемент
(
Код_читателя,
Код_книги,
Дата_выдачи,
Срок,
Отметка_о_возврате)
VALUES
(1,1,'2020-10-24','2022-01-02','True'),
(2,1,'2019-06-04','2022-07-04','True'),
(3,1,'2022-04-10','2023-04-10','True'),
(4,4,'2022-05-12','2024-07-12','True'),
(5,5,'2018-06-04','2020-10-20','True'),
(6,6,'2015-07-12','2016-08-15','False'),
(7,4,'2021-11-22','2021-12-22','False'),
(8,8,'2012-03-01','2013-03-02','True'),
(9,9,'2016-02-15','2017-06-12','False'),
(10,10,'2017-02-15','2020-11-05','True');
