Create table Заказы
(Номер_заказа int Primary key,
Код_клиента int not null,
Дата_заказа date not null,
Срок_сборки int not null,
Дополнительная_информация_о_заказе nvarchar(50) null,
Адрес_доставки nvarchar(50) not null)

Insert into Заказы

values
(1, 1231,'2019-09-20',2,null,'Москва'),
(2, 2812,'2017-08-08',3,null,'Волгоградская'),
(3, 3425,'2021-10-14',1,null,'Москва'),
(4, 3910,'2017-08-28',2,null,'Москва'),
(5, 4671,'2017-06-04',4,null,'Москва'),
(6, 5710,'2018-02-01',7,null,'Домодедовская'),
(7, 8290,'2020-10-19',1,null,'Москва'),
(8, 7309,'2020-01-30',9,null,'Курская'),
(9, 8261,'2019-05-05',3,null,'Москва'),
(10, 9189,'2019-11-04',2,null,'Москва');

Create table Содержимое_заказов
(Номер_заказа int not null,
Код_товара int not null,
Количество int not null,
Упаковка nvarchar(30) null,
Constraint [Номер_заказа] primary key clustered (Номер_заказа,Код_товара),
foreign key (Номер_заказа) references Заказы (Номер_заказа)
ON DELETE CASCADE
ON UPDATE CASCADE)

Insert into Содержимое_заказов

values
(1,3,10,'Подарочная'),
(2,4,15,'Подарочная'),
(3,5,20,'Обычная'),
(4,6,25,'Обычная'),
(5,7,30,'Подарочная'),
(6,8,35,'Обычная'),
(7,9,40,'Обычная'),
(8,10,45,'Подарочная'),
(9,11,50,'Подарочная'),
(10,12,55,'Подарочная');